basic/controllers/AnswerController.php

INSERT INTO `Answer` (`answer_name`) VALUES ('Schildkröte')
SELECT * FROM `Question` WHERE `id`='27'
---
    public function actionCreate($question_id, $survey_id)
        //$survey_id ist notwendig, um auf die Survey zurückzukommen, für die man die Answer erstellt hat.
    {
        $model = new Answer();

        //Die Question holen, die im survey/view erstellungsformular erstellt wurde.
        $question = Question::find()->where(['id'=>$question_id]);

            if ($model->load(Yii::$app->request->post()) && $model->save()) {

                $model->link('questions', $question->one());

UPDATE `Answer` SET `answer_votes`=1 WHERE `id`=66
---
    public function actionVote ($vote_id, $survey_id) {
        $model = $this->findModel($vote_id);
        $model->answer_votes += 1;


        // Session setzen. Variable enthält als schlüssel die Survey und als Wert die 1.
        // Im index wird überprüft, ob eine Session variable der Survey 1 entspricht.
        // Wenn ja, wird der teilnehmen Button nicht dargestellt.
        $session = Yii::$app->session;

        if (!isset($session['survey--'.$survey_id])) {
            if (!$session->isActive) {
                $session->open();
            }
            $session->set('survey--'.$survey_id, 1);
        }

        if ($model->save()){

SELECT * FROM `Answer` WHERE `id`='66'
---
    protected function findModel($id)
    {
        if (($model = Answer::findOne($id)) !== null) {