basic/controllers/SurveyController.php

    public function actionCreate()
    {
        $model = new Survey(['scenario'=>'create']);

        $date = date_create();


        $model->user_id = Yii::$app->user->identity->id;
        $model->survey_timestamp = date_timestamp_get($date);



        if ($model->load(Yii::$app->request->post()) && $model->save() ) {
---
INSERT INTO `Survey` (`user_id`, `survey_timestamp`, `survey_name`, `survey_theme`, `survey_runtime`, `survey_activated`) VALUES (22, 1436816170, 'dfwefewfr', 'qwdewdewr', 1800, 0)

    public function actionToggleactivate ($id){
        $model = $this->findModel($id);

        if ($model->survey_activated == 1) {
            $model->survey_activated = 0;
        }
        elseif ($model->survey_activated ==0) {
            $model->survey_activated = 1;
        }
        if ($model->save()){
---
UPDATE `Survey` SET `survey_timestamp`=1436815678, `survey_activated`=1 WHERE `id`=11

    public function actionTakesurvey ($id){


        $model = Survey::findOne($id);
---
SELECT * FROM `Survey` WHERE `id`='11'

    protected function findModel($id)
    {
        if (($model = Survey::findOne($id)) !== null) {
---
SELECT * FROM `Survey` WHERE `id`='11'