basic/components/ToggleSurveys.php

        public function init() {
            date_default_timezone_set('Europe/Berlin');

            $dataProvider = new ActiveDataProvider([
                'query' => Survey::find(),
            ]);
            $surveys = $dataProvider->getModels();
            foreach ($surveys as $data) {
                $endtime = $data->survey_timestamp+$data->survey_runtime;
                if ($endtime <= time()) {
                    $data->survey_activated = 0;
                    $data->save();
---
SELECT * FROM `Survey` LIMIT 20
SELECT COUNT(*) FROM `Survey`
UPDATE `Survey` SET `survey_activated`=0 WHERE `id`=11