basic/models/User.php

SELECT * FROM `User` WHERE `id`=22
---
    public static function findIdentity($id) {
        $dbUser = DbUser::find()
            ->where([
                "id" => $id
            ])
            ->one();